# Agenda for today

## First, the debugger

In [1]:
def mysum(*numbers):
    total = 0
    for one_number in numbers:
        total += one_number
    return total

In [2]:

mysum(10, 20, 30)

60

In [3]:
mysum(100, 200, 300)

600

In [5]:
mysum([10, 20, 30])

TypeError: unsupported operand type(s) for +=: 'int' and 'list'

## Next, serious stuff

### Serious 1

### Serious 2

### Serious 3

# Final stuff

Hello!

# Actual agenda

1. Multi-indexing
2. Sorting
3. Grouping
4. Pivot tables

Download the data files from here:

https://files.lerner.co.il/pandas-workout-data.zip

In [7]:
import pandas as pd
from pandas import Series, DataFrame

In [8]:
import numpy as np

In [9]:
df = DataFrame(np.random.randint(0, 1000, [4, 5]),
               index=list('abcd'),
               columns=list('vwxyz'))

In [10]:
df

     v    w    x    y    z
a   40  128  238  840  321
b  288  748  292  867  939
c  917  942  832  391  657
d  945  345  211  343  525

In [12]:
# reset_index -- turns the index into a regular column

df = df.reset_index()
df

  index    v    w    x    y    z
0     a   40  128  238  840  321
1     b  288  748  292  867  939
2     c  917  942  832  391  657
3     d  945  345  211  343  525

In [15]:
df.columns = list('uvwxyz')

In [16]:
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [17]:
help(df.reset_index)

Help on method reset_index in module pandas.core.frame:

reset_index(level: 'IndexLabel' = None, *, drop: 'bool' = False, inplace: 'bool' = False, col_level: 'Hashable' = 0, col_fill: 'Hashable' = '', allow_duplicates: 'bool | lib.NoDefault' = <no_default>, names: 'Hashable | Sequence[Hashable]' = None) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Reset the index, or a level of it.

    Reset the index of the DataFrame, and use the default one instead.
    If the DataFrame has a MultiIndex, this method can remove one or more
    levels.

    Parameters
    ----------
    level : int, str, tuple, or list, default None
        Only remove the given levels from the index. Removes all levels by
        default.
    drop : bool, default False
        Do not try to insert index into dataframe columns. This resets
        the index to the default integer index.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    col_level : int or str, default 0
        If the columns have multiple levels, determines which level the
        labels are inserted into. By default it is inserted into the first
        level.
    col_fill : object, default ''
        If the columns have multiple levels, determines how the other
        levels are named. If None then the index name is repeated.
    allow_duplicates : bool, optional, default lib.no_default
        Allow duplicate column labels to be created.

        .. versionadded:: 1.5.0

    names : int, str or 1-dimensional list, default None
        Using the given string, rename the DataFrame column which contains the
        index data. If the DataFrame has a MultiIndex, this has to be a list or
        tuple with length equal to the number of levels.

        .. versionadded:: 1.5.0

    Returns
    -------
    DataFrame or None
        DataFrame with the new index or None if ``inplace=True``.

    See Also
    --------
    DataFrame.set_index : Opposite of reset_index.
    DataFrame.reindex : Change to new indices or expand indices.
    DataFrame.reindex_like : Change to same indices as other DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame([('bird', 389.0),
    ...                    ('bird', 24.0),
    ...                    ('mammal', 80.5),
    ...                    ('mammal', np.nan)],
    ...                   index=['falcon', 'parrot', 'lion', 'monkey'],
    ...                   columns=('class', 'max_speed'))
    >>> df
             class  max_speed
    falcon    bird      389.0
    parrot    bird       24.0
    lion    mammal       80.5
    monkey  mammal        NaN

    When we reset the index, the old index is added as a column, and a
    new sequential index is used:

    >>> df.reset_index()
        index   class  max_speed
    0  falcon    bird      389.0
    1  parrot    bird       24.0
    2    lion  mammal       80.5
    3  monkey  mammal        NaN

    We can use the `drop` parameter to avoid the old index being added as
    a column:

    >>> df.reset_index(drop=True)
        class  max_speed
    0    bird      389.0
    1    bird       24.0
    2  mammal       80.5
    3  mammal        NaN

    You can also use `reset_index` with `MultiIndex`.

    >>> index = pd.MultiIndex.from_tuples([('bird', 'falcon'),
    ...                                    ('bird', 'parrot'),
    ...                                    ('mammal', 'lion'),
    ...                                    ('mammal', 'monkey')],
    ...                                   names=['class', 'name'])
    >>> columns = pd.MultiIndex.from_tuples([('speed', 'max'),
    ...                                      ('species', 'type')])
    >>> df = pd.DataFrame([(389.0, 'fly'),
    ...                    (24.0, 'fly'),
    ...                    (80.5, 'run'),
    ...                    (np.nan, 'jump')],
    ...                   index=index,
    ...                   columns=columns)
    >>> df
                   speed species
                     max    type
    class  name
    bird   falcon  389.0     fly
           parrot   24.0     fly
    mammal lion     80.5     run
           monkey    NaN    jump

    Using the `names` parameter, choose a name for the index column:

    >>> df.reset_index(names=['classes', 'names'])
      classes   names  speed species
                         max    type
    0    bird  falcon  389.0     fly
    1    bird  parrot   24.0     fly
    2  mammal    lion   80.5     run
    3  mammal  monkey    NaN    jump

    If the index has multiple levels, we can reset a subset of them:

    >>> df.reset_index(level='class')
             class  speed species
                      max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    If we are not dropping the index, by default, it is placed in the top
    level. We can place it in another level:

    >>> df.reset_index(level='class', col_level=1)
                    speed species
             class    max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    When the index is inserted under another level, we can specify under
    which one with the parameter `col_fill`:

    >>> df.reset_index(level='class', col_level=1, col_fill='species')
                  species  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

    If we specify a nonexistent level for `col_fill`, it is created:

    >>> df.reset_index(level='class', col_level=1, col_fill='genus')
                    genus  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

In [18]:
df.index = range(1, len(df.index)+1)

In [19]:

df

   u    v    w    x    y    z
1  a   40  128  238  840  321
2  b  288  748  292  867  939
3  c  917  942  832  391  657
4  d  945  345  211  343  525

In [20]:
df.index

RangeIndex(start=1, stop=5, step=1)

In [21]:
# make v the index

df.set_index('v')

     u    w    x    y    z
v
40   a  128  238  840  321
288  b  748  292  867  939
917  c  942  832  391  657
945  d  345  211  343  525

In [22]:
df = df.set_index('v')

In [23]:
df

     u    w    x    y    z
v
40   a  128  238  840  321
288  b  748  292  867  939
917  c  942  832  391  657
945  d  345  211  343  525

In [24]:
df['v']

KeyError: 'v'

In [25]:
%xmode Minimal

Exception reporting mode: Minimal

In [26]:
df.index

Index([40, 288, 917, 945], dtype='int64', name='v')

In [27]:
df = df.reset_index()

In [28]:
df

     v  u    w    x    y    z
0   40  a  128  238  840  321
1  288  b  748  292  867  939
2  917  c  942  832  391  657
3  945  d  345  211  343  525

In [31]:
# get them in the "right" order
df = df[['u', 'v', 'w', 'x', 'y', 'z']]
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [32]:
# what happens if I set an index with more than one item?

df.set_index(['u', 'y'])

         v    w    x    z
u y
a 840   40  128  238  321
b 867  288  748  292  939
c 391  917  942  832  657
d 343  945  345  211  525

In [33]:
df

   u    v    w    x    y    z
0  a   40  128  238  840  321
1  b  288  748  292  867  939
2  c  917  942  832  391  657
3  d  945  345  211  343  525

In [35]:
df['u'] = list('abab')
df['v'] = [10, 20, 30, 10]

In [37]:
df = df.set_index(['u', 'v'])
df

        w    x    y    z
u v
a 10  128  238  840  321
b 20  748  292  867  939
a 30  942  832  391  657
b 10  345  211  343  525

In [38]:
df.loc['a']

      w    x    y    z
v
10  128  238  840  321
30  942  832  391  657

In [39]:
df.loc[('a', 10)]

w    128
x    238
y    840
z    321
Name: (a, 10), dtype: int64

In [40]:
df.loc[['a', 10]]

KeyError: '[10] not in index'

In [41]:
df.loc[(:, 10)]

SyntaxError: invalid syntax (1953882588.py, line 1)

In [42]:
df.xs(10, level=1)

     w    x    y    z
u
a  128  238  840  321
b  345  211  343  525

In [43]:
df

        w    x    y    z
u v
a 10  128  238  840  321
b 20  748  292  867  939
a 30  942  832  391  657
b 10  345  211  343  525

In [44]:
help(df.set_index)

Help on method set_index in module pandas.core.frame:

set_index(keys, *, drop: 'bool' = True, append: 'bool' = False, inplace: 'bool' = False, verify_integrity: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Set the DataFrame index using existing columns.

    Set the DataFrame index (row labels) using one or more existing
    columns or arrays (of the correct length). The index can replace the
    existing index or expand on it.

    Parameters
    ----------
    keys : label or array-like or list of labels/arrays
        This parameter can be either a single column key, a single array of
        the same length as the calling DataFrame, or a list containing an
        arbitrary combination of column keys and arrays. Here, "array"
        encompasses :class:`Series`, :class:`Index`, ``np.ndarray``, and
        instances of :class:`~collections.abc.Iterator`.
    drop : bool, default True
        Delete columns to be used as the new index.
    append : bool, default False
        Whether to append columns to existing index.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    verify_integrity : bool, default False
        Check the new index for duplicates. Otherwise defer the check until
        necessary. Setting to False will improve the performance of this
        method.

    Returns
    -------
    DataFrame or None
        Changed row labels or None if ``inplace=True``.

    See Also
    --------
    DataFrame.reset_index : Opposite of set_index.
    DataFrame.reindex : Change to new indices or expand indices.
    DataFrame.reindex_like : Change to same indices as other DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame({'month': [1, 4, 7, 10],
    ...                    'year': [2012, 2014, 2013, 2014],
    ...                    'sale': [55, 40, 84, 31]})
    >>> df
       month  year  sale
    0      1  2012    55
    1      4  2014    40
    2      7  2013    84
    3     10  2014    31

    Set the index to become the 'month' column:

    >>> df.set_index('month')
           year  sale
    month
    1      2012    55
    4      2014    40
    7      2013    84
    10     2014    31

    Create a MultiIndex using columns 'year' and 'month':

    >>> df.set_index(['year', 'month'])
                sale
    year  month
    2012  1     55
    2014  4     40
    2013  7     84
    2014  10    31

    Create a MultiIndex using an Index and a column:

    >>> df.set_index([pd.Index([1, 2, 3, 4]), 'year'])
             month  sale
       year
    1  2012  1      55
    2  2014  4      40
    3  2013  7      84
    4  2014  10     31

    Create a MultiIndex using two Series:

    >>> s = pd.Series([1, 2, 3, 4])
    >>> df.set_index([s, s**2])
          month  year  sale
    1 1       1  2012    55
    2 4       4  2014    40
    3 9       7  2013    84
    4 16     10  2014    31

In [45]:
df

        w    x    y    z
u v
a 10  128  238  840  321
b 20  748  292  867  939
a 30  942  832  391  657
b 10  345  211  343  525

In [49]:
df = pd.read_csv('taxi.csv',
                 usecols=['passenger_count', 'VendorID',
                         'trip_distance', 'total_amount'],
                index_col=['VendorID','passenger_count'])
df

                          trip_distance  total_amount
VendorID passenger_count
2        1                         1.63         17.80
         1                         0.46          8.30
         1                         0.87         11.00
         1                         2.13         17.16
1        1                         1.40         10.30
...                                 ...           ...
         1                         2.70         12.30
         1                         4.50         20.30
2        1                         5.59         22.30
         6                         1.54          7.80
1        1                         5.80         26.75

[9999 rows x 2 columns]

In [50]:
df.loc[2]

                 trip_distance  total_amount
passenger_count
1                         1.63         17.80
1                         0.46          8.30
1                         0.87         11.00
1                         2.13         17.16
1                         1.27         15.80
...                        ...           ...
1                         6.07         26.62
1                         1.48          9.30
1                         6.37         23.30
1                         5.59         22.30
6                         1.54          7.80

[5166 rows x 2 columns]

In [51]:
# vendor 2, 1 passenger

df.loc[(2, 1)]

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_75344/1701779935.py:3: PerformanceWarning: indexing past lexsort depth may impact performance.
  df.loc[(2, 1)]

                          trip_distance  total_amount
VendorID passenger_count
2        1                         1.63         17.80
         1                         0.46          8.30
         1                         0.87         11.00
         1                         2.13         17.16
         1                         1.27         15.80
...                                 ...           ...
         1                         5.55         21.35
         1                         6.07         26.62
         1                         1.48          9.30
         1                         6.37         23.30
         1                         5.59         22.30

[3195 rows x 2 columns]

In [52]:
!ls *oly*

2180.42s - pydevd: Sending message related to process being replaced timed-out after 5 seconds
olympic_athlete_events.csv

In [53]:
!head olympic_athlete_events.csv

2216.86s - pydevd: Sending message related to process being replaced timed-out after 5 seconds
"ID","Name","Sex","Age","Height","Weight","Team","NOC","Games","Year","Season","City","Sport","Event","Medal"
"1","A Dijiang","M",24,180,80,"China","CHN","1992 Summer",1992,"Summer","Barcelona","Basketball","Basketball Men's Basketball",NA
"2","A Lamusi","M",23,170,60,"China","CHN","2012 Summer",2012,"Summer","London","Judo","Judo Men's Extra-Lightweight",NA
"3","Gunnar Nielsen Aaby","M",24,NA,NA,"Denmark","DEN","1920 Summer",1920,"Summer","Antwerpen","Football","Football Men's Football",NA
"4","Edgar Lindenau Aabye","M",34,NA,NA,"Denmark/Sweden","DEN","1900 Summer",1900,"Summer","Paris","Tug-Of-War","Tug-Of-War Men's Tug-Of-War","Gold"
"5","Christine Jacoba Aaftink","F",21,185,82,"Netherlands","NED","1988 Winter",1988,"Winter","Calgary","Speed Skating","Speed Skating Women's 500 metres",NA
"5","Christine Jacoba Aaftink","F",21,185,82,"Netherlands","NED","1988 Winter",1988,"Winter","Calgary","Speed Skating","Speed Skating Women's 1,000 metres",NA
"5","Christine Jacoba Aaftink","F",25,185,82,"Netherlands","NED","1992 Winter",1992,"Winter","Albertville","Speed Skating","Speed Skating Women's 500 metres",NA
"5","Christine Jacoba Aaftink","F",25,185,82,"Netherlands","NED","1992 Winter",1992,"Winter","Albertville","Speed Skating","Speed Skating Women's 1,000 metres",NA
"5","Christine Jacoba Aaftink","F",27,185,82,"Netherlands","NED","1994 Winter",1994,"Winter","Lillehammer","Speed Skating","Speed Skating Women's 500 metres",NA

# Exercise: Olympic events

1. Read the file `olympic_athlete_events.csv` into a data frame. We want all of the columns.
2. Make the index Year + Sport + Event.
3. What was the average height for all athletes in 1992?
4. What were the average height and weight for all basketball players?

In [ ]:
df = df.set_index('colname')
df = df.set_index(['col1', 'col2'])

In [55]:
df = pd.read_csv('olympic_athlete_events.csv',
                index_col=['Year', 'Sport', 'Event'])
df.head()

,,,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Medal
Year,Sport,Event,,,,,,,,,,,,
1992,Basketball,Basketball Men's Basketball,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,Summer,Barcelona,NaN
2012,Judo,Judo Men's Extra-Lightweight,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,Summer,London,NaN
1920,Football,Football Men's Football,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Summer,Antwerpen,NaN
1900,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Summer,Paris,Gold
1988,Speed Skating,Speed Skating Women's 500 metres,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Winter,Calgary,NaN

In [58]:
df.loc[1992,  # row selector
'Height' # column selector
].mean()

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_75344/1286576537.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  df.loc[1992,  # row selector

176.17464873848013

In [59]:
df.loc[1992].loc[:, 'Height']

Sport                  Event
Basketball             Basketball Men's Basketball                 180.0
Speed Skating          Speed Skating Women's 500 metres            185.0
                       Speed Skating Women's 1,000 metres          185.0
Cross Country Skiing   Cross Country Skiing Men's 10 kilometres    188.0
                       Cross Country Skiing Men's 50 kilometres    188.0
                                                                   ...
Synchronized Swimming  Synchronized Swimming Women's Duet          167.0
Volleyball             Volleyball Men's Volleyball                 200.0
Athletics              Athletics Women's 800 metres                172.0
Fencing                Fencing Men's epee, Team                    175.0
Rowing                 Rowing Men's Double Sculls                  197.0
Name: Height, Length: 16413, dtype: float64